from z3 import *

a0, a1, a2, a3, a4, a5 = Ints('a0 a1 a2 a3 a4 a5')
s = Solver()
s.add(a2 - a3 == 2225223423)
s.add(a3 + a4 == 4201428739)
s.add(a2 - a4 == 1121399208)
s.add(a0 == -548868226)
s.add(a5 == -2064448480)
s.add(a1 == 550153460)
if s.check() == sat:
    print(s.model())

'''
[a4 = 2652626477,
 a0 = -548868226,
 a2 = 3774025685,
 a5 = -2064448480,
 a3 = 1548802262,
 a1 = 550153460]
 { -548868226, 550153460, 3774025685, 1548802262, 2652626477, 2230518816 };
'''
# 不可以这样，结果会出错！
b0, b1, b2, b3, b4, b5 = Ints('b0 b1 b2 b3 b4 b5')
s1 = Solver()
s1.add(b2 == 0x84A236FF + b3)
s1.add(b3 + b4 == 0xFA6CB703)
s1.add(b1  == 0x42D731A8 + b4)
s1.add(b0 == 0xDF48EF7E)
s1.add(b5 == 0x84F30420)
s1.add(b1 == 0x20CAACF4)
if s1.check() == sat:
    print(s1.model())

'''
[b5 = 2230518816,
 b0 = 3746099070,
 b4 = -571245748,
 b3 = 4772674487,
 b2 = 6997897910,
 b1 = 550153460]
'''